
/******************************************************************/
/*                       st_solve_gauss                           */
/*                       ==============                           */
/*   Решение системы уравнений методом Гаусса                     */ 
/******************************************************************/

void st_solve_gauss (int dim_mas_r, double mas_r[DIM][DIM], double v_pch[], double vz[]  )
{
   int      i,i1,j;
   double   diag,k_minus;

   /*---------------------------------------*/
   /*   Прямой ход по левой и правой части  */
   /*---------------------------------------*/
   for( i=0 ; i < dim_mas_r-1 ;  i++)
   {
      diag=mas_r[i][i];
  
      for( i1=i+1 ; i1 < dim_mas_r ; i1++ )
	 {
           k_minus=mas_r[i1][i]/diag;
          // Левая часть
	   for (j=i ; j < dim_mas_r ; j++)
	      mas_r[i1][j]-=mas_r[i][j]*k_minus;
	  // Правая часть
           v_pch[i1]-=v_pch[i]*k_minus;
     }
   }
   /*------------------------------------------------*/
   /*   Обратный ход, вычисление вектора неизвестных */
   /*------------------------------------------------*/
   for ( i=0 ; i < dim_mas_r ; i++ )
     vz[i]=v_pch[i];

   for( i=dim_mas_r-1 ; i >= 0 ;  i--)
   {
  	 for( j=i+1 ; j < dim_mas_r ; j++ )
	   vz[i]-=mas_r[i][j]*vz[j];

	 vz[i]/=mas_r[i][i];
   } 
 
}

